**English:** Import pandas for data manipulation and numpy for numerical operations.
**Hindi:** Pandas ko data manipulation ke liye aur numpy ko numerical operations ke liye import karein.

In [1]:
import pandas as pd
import numpy as np

**English:** Create a dictionary with sample data. This dictionary contains lists of player names, runs, ages, and cities, including some missing values (`np.nan`, `pd.NA`).
**Hindi:** Sample data ke saath ek dictionary banayein. Is dictionary mein khiladiyon ke naam, run, umar, aur shaharon ki list hai, jismein kuchh missing values (`np.nan`, `pd.NA`) bhi shamil hain.

In [2]:
data ={
    'names':['sachin','virat','dhoni','rohit','pant','rahul',np.nan,'jasprit','yuvraj','surya'],
    'runs':[5676,5461,5434,5460,2333,4554,5665,431,3243,pd.NA],
    'age':[43,np.nan,43,34,23,43,54,34,32,23],
    'city':['mumbai','dilhi','ranchi','mumbai','dilhi',np.nan,'mumbai','ahmadabad','panjab','mumbai']
}

**English:** Create a pandas DataFrame from the dictionary.
**Hindi:** Dictionary se ek pandas DataFrame banayein.

In [3]:
df = pd.DataFrame(data)

**English:** Use `.iloc` to replace the value at the 7th row (index 6) and 1st column (index 0) with 'sunil'.
**Hindi:** 7th row (index 6) aur 1st column (index 0) par value ko 'sunil' se replace karne ke liye `.iloc` ka upyog karein.

In [4]:
df.iloc[6,0] = 'sunil'

**English:** Fill missing values in the 'age' column with the mean of the column. The `inplace=True` argument modifies the DataFrame directly.
**Hindi:** 'age' column mein missing values ko column ke mean se bharein. `inplace=True` argument DataFrame ko seedhe modify karta hai.

In [5]:
df['age'].fillna(int(df['age'].mean()),inplace = True)

/tmp/ipykernel_2279/78945105.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(int(df['age'].mean()),inplace = True)

**English:** This is a commented-out line that would have filled missing 'city' values with 'bengaluru'.
**Hindi:** Yeh ek commented-out line hai jo 'city' ke missing values ko 'bengaluru' se bhar deti.

In [6]:
# df['city'].fillna('bengaluru',inplace=True)

**English:** Fill missing values in the 'city' column with the string 'bengaluru'.
**Hindi:** 'city' column mein missing values ko 'bengaluru' string se bharein.

In [7]:
df['city'] = df['city'].fillna('bengaluru')

**English:** Fill missing values in the 'runs' column with the mean of the column.
**Hindi:** 'runs' column mein missing values ko column ke mean se bharein.

In [8]:
df['runs'].fillna(df['runs'].mean(),inplace = True)

/tmp/ipykernel_2279/1100828494.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['runs'].fillna(df['runs'].mean(),inplace = True)
/tmp/ipykernel_2279/1100828494.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['runs'].fillna(df['runs'].mean(),inplace = True)

**English:** Round the 'runs' column to the nearest integer and convert its data type to integer.
**Hindi:** 'runs' column ko nearest integer tak round karein aur iska data type integer mein convert karein.

In [9]:
df['runs'] = df['runs'].round().astype(int)

**English:** Display the entire DataFrame to see the changes.
**Hindi:** Badlav dekhne ke liye poora DataFrame display karein.

In [10]:
df

     names  runs   age       city
0   sachin  5676  43.0     mumbai
1    virat  5461  36.0      dilhi
2    dhoni  5434  43.0     ranchi
3    rohit  5460  34.0     mumbai
4     pant  2333  23.0      dilhi
5    rahul  4554  43.0  bengaluru
6    sunil  5665  54.0     mumbai
7  jasprit   431  34.0  ahmadabad
8   yuvraj  3243  32.0     panjab
9    surya  4251  23.0     mumbai

**English:** Check for missing values in the DataFrame. `.isna().sum()` counts the number of NaN values in each column.
**Hindi:** DataFrame mein missing values check karein. `.isna().sum()` har column mein NaN values ki sankhya ginta hai.

In [11]:
df.isna().sum()

names    0
runs     0
age      0
city     0
dtype: int64

**English:** Filter the DataFrame to show the 'names' of players where the 'city' is 'mumbai'.
**Hindi:** DataFrame ko filter karke un khiladiyon ke 'names' dikhayein jinka 'city' 'mumbai' hai.

In [12]:
df[df['city'] == 'mumbai']['names']

0    sachin
3     rohit
6     sunil
9     surya
Name: names, dtype: object

**English:** This section appears to be for loading a new dataset from Kaggle, but it's not used in the subsequent cells.
**Hindi:** Yah section Kaggle se ek naya dataset load karne ke liye lagta hai, lekin iska upyog aage ke cells mein nahi kiya gaya hai.

In [13]:
import pandas as pd
file_path = '/home/user/dsml-ghost/pandas_files/Sample - Superstore.csv'
df = pd.read_csv(file_path, encoding='latin1')

**English:** Display the first 5 rows of the new DataFrame.
**Hindi:** Naye DataFrame ke pehle 5 rows display karein.

In [14]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

**English:** Display the last 5 rows of the DataFrame.
**Hindi:** DataFrame ke aakhri 5 rows display karein.

In [15]:
df.tail()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9989,9990,CA-2014-110422,1/21/2014,1/23/2014,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.248,3,0.2,4.1028
9990,9991,CA-2017-121258,2/26/2017,3/3/2017,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.960,2,0.0,15.6332
9991,9992,CA-2017-121258,2/26/2017,3/3/2017,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.576,2,0.2,19.3932
9992,9993,CA-2017-121258,2/26/2017,3/3/2017,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.600,4,0.0,13.3200
9993,9994,CA-2017-119914,5/4/2017,5/9/2017,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.160,2,0.0,72.9480

**English:** Intentionally introduce missing values and inconsistencies for cleaning practice. This code adds NaNs, makes some city names lowercase, and adds extra spaces to the 'Category' column.
**Hindi:** Safai ki practice ke liye jaanbujhkar missing values aur inconsistencies introduce karein. Yah code NaNs add karta hai, kuchh city names ko lowercase banata hai, aur 'Category' column mein extra spaces add karta hai.

In [16]:
for col in ['Sales', 'Profit', 'Discount', 'City', 'Customer Name']:
    df.loc[df.sample(frac=0.05).index, col] = np.nan
df.loc[df['City'].sample(frac=0.03).index, 'City'] = df['City'].str.lower()
df['Category'] = df['Category'].apply(lambda x: ' ' + x + ' ' if np.random.rand() < 0.1 else x)

**English:** Get information about the DataFrame, including the data types and non-null counts of each column.
**Hindi:** DataFrame ke baare mein jaankari prapt karein, jismein har column ke data types aur non-null counts shamil hain.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   object
 3   Ship Date      9994 non-null   object
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9494 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9494 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9494 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9494 non-null   float64
 20  Profit         9494 non-null   float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

**English:** Generate descriptive statistics for the numerical columns.
**Hindi:** Numerical columns ke liye descriptive statistics generate karein.

In [18]:
df.describe()

,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994.000000,9494.000000,9994.000000,9494.000000,9494.000000
mean,4997.500000,55190.379428,231.098685,3.789574,0.156494,28.596052
std,2885.163629,32063.693350,631.806523,2.225110,0.206705,233.897453
min,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2499.250000,23223.000000,17.140000,2.000000,0.000000,1.760800
50%,4997.500000,56430.500000,54.900000,3.000000,0.200000,8.679950
75%,7495.750000,90008.000000,209.984250,5.000000,0.200000,29.362500
max,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000

**English:** Count the total number of missing values in each column after intentionally adding them.
**Hindi:** Jaanbujhkar missing values add karne ke baad har column mein कुल missing values ki ginti karein.

In [19]:
df.isna().sum()

Row ID             0
Order ID           0
Order Date         0
Ship Date          0
Ship Mode          0
Customer ID        0
Customer Name    500
Segment            0
Country            0
City             500
State              0
Postal Code        0
Region             0
Product ID         0
Category           0
Sub-Category       0
Product Name       0
Sales            500
Quantity           0
Discount         500
Profit           500
dtype: int64

**English:** Fill the missing values in 'Sales', 'Profit', and 'Discount' columns with their respective means.
**Hindi:** 'Sales', 'Profit', aur 'Discount' columns mein missing values ko unke respective means se bharein.

In [20]:
df['Sales'].fillna(df['Sales'].mean(),inplace = True)

/tmp/ipykernel_2279/3204668359.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Sales'].fillna(df['Sales'].mean(),inplace = True)

In [21]:
df['Profit'].fillna(df['Profit'].mean(),inplace = True)

/tmp/ipykernel_2279/901236227.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Profit'].fillna(df['Profit'].mean(),inplace = True)

In [22]:
df['Discount'].fillna(df['Discount'].mean(),inplace = True)

/tmp/ipykernel_2279/2909751740.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Discount'].fillna(df['Discount'].mean(),inplace = True)

**English:** Fill the missing values in 'City' and 'Customer Name' columns with the string 'unknown'.
**Hindi:** 'City' aur 'Customer Name' columns mein missing values ko 'unknown' string se bharein.

In [23]:
df[['City', 'Customer Name']] = df[['City', 'Customer Name']].fillna('unknown')

**English:** Verify that there are no more missing values in the 'City' and 'Customer Name' columns.
**Hindi:** Verify karein ki 'City' aur 'Customer Name' columns mein ab koi missing values nahi hain.

In [24]:
df[['City','Customer Name']].isna().sum()

City             0
Customer Name    0
dtype: int64

**English:** Remove leading/trailing whitespace from the 'Category' column.
**Hindi:** 'Category' column se leading/trailing whitespace hatayein.

In [25]:
df['Category'].str.strip()

0             Furniture
1             Furniture
2       Office Supplies
3             Furniture
4       Office Supplies
             ...
9989          Furniture
9990          Furniture
9991         Technology
9992    Office Supplies
9993    Office Supplies
Name: Category, Length: 9994, dtype: object

**English:** Capitalize the first letter of each city name in the 'City' column.
**Hindi:** 'City' column mein har shahar ke naam ka pehla akshar capitalize karein.

In [26]:
df['City'].str.capitalize()

0             Henderson
1             Henderson
2           Los angeles
3       Fort lauderdale
4               Unknown
             ...
9989            Unknown
9990         Costa mesa
9991         Costa mesa
9992         Costa mesa
9993        Westminster
Name: City, Length: 9994, dtype: object

**English:** Remove duplicate rows from the DataFrame and reset the index.
**Hindi:** DataFrame se duplicate rows hatayein aur index reset karein.

In [27]:
df.drop_duplicates(inplace=True)
df.reset_index(drop=True, inplace=True)

**English:** Verify that all duplicate rows have been removed.
**Hindi:** Verify karein ki sabhi duplicate rows hata diye gaye hain.

In [28]:
df.duplicated().sum()

np.int64(0)

**English:** Group the data by 'City', calculate the sum of 'Sales' for each city, and sort the results in descending order. Then display the top 5 cities by sales.
**Hindi:** Data ko 'City' se group karein, har shahar ke liye 'Sales' ka sum calculate karein, aur results ko descending order mein sort karein. Fir sales ke hisab se top 5 shaharon ko display karein.

In [29]:
df.groupby('City')['Sales'].sum().sort_values(ascending=False).head(5)

City
New York City    227783.262039
Los Angeles      162411.889354
unknown          117395.358646
Seattle          114276.979075
San Francisco    109755.771872
Name: Sales, dtype: float64

**English:** Calculate the 'Profit margin' as a percentage and create a new column for it.
**Hindi:** 'Profit margin' ko percentage ke roop mein calculate karein aur iske liye ek naya column banayein.

In [30]:
df['Profit margin'] = (df['Profit'] / df['Sales']) * 100

**English:** Display the new 'Profit margin' column.
**Hindi:** Naya 'Profit margin' column display karein.

In [31]:
df['Profit margin']

0       16.000000
1       95.016551
2       47.000000
3        2.986291
4       11.250000
          ...
9989    16.250000
9990    17.000000
9991     7.500000
9992    45.000000
9993    30.000000
Name: Profit margin, Length: 9994, dtype: float64

**English:** Save the cleaned and processed DataFrame to a new CSV file named 'cleared csv'.
**Hindi:** Saaf aur processed DataFrame ko 'cleared csv' naam ki ek nayi CSV file mein save karein.

In [32]:
df.to_csv('cleared csv')